runs/snake3d/back_lip/1k25/RANS/0_org/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];

internalField uniform (1.0 0.0 0.0);

boundaryField
{
  snake
  {
    type  fixedValue;
    value uniform (0.0 0.0 0.0);
  }
  inlet
  {
    type  fixedValue;
    value uniform (1.0 0.0 0.0);
  }
  outlet
  {
    type inletOutlet;
    inletValue uniform (0.0 0.0 0.0);
    value uniform (1.0 0.0 0.0);
  }
  bottom
  {
    type symmetryPlane;
  }
  top
  {
    type symmetryPlane;
  }
  front
  {
    type cyclic;
  }
  back
  {
    type cyclic;
  }
}

//****************************************************************************//
